src/cf/src/DataProcessors/АРМПроизводство/АРМПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АРМПроизводство</name>
  <comment>Рабочее место производства: заказы, их состав и связанные производственные документы.</comment>
</mdclass:DataProcessor>

src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Allow</posting>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказаПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Техкарта</name>
      <type>
        <types>DocumentRef.ТехнологическаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПродукции</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРодителя</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ПредложениеПоставщика</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ВидЗаказа</name>
    <type>
      <types>EnumRef.ВидыЗаказовПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>ЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/DataProcessors/АРМПроизводство/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

// Последний черновик, в который записана строка клиента: ключ - клиент, значение - Структура Заказ, ЗаказПредставление.
&НаКлиенте
Перем ПоследниеЧерновики;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПоказыватьСуммы = Обработки.АРМПроизводство.ПоказыватьСуммы();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Обработки.АРМПроизводство.ПраваРабочегоМеста());
	НастроитьЭлементы();
	УстановитьУсловноеОформление();
	УстановитьПараметрыСписка();
	ПрименитьСостояниеПанели(ЭтотОбъект);
	// Сохранённые настройки перечитают «Продукцию» в ПриЗагрузкеДанныхИзНастроекНаСервере по своему тумблеру.
	Если Не ЕстьСохраненныеНастройки() Тогда
		ЗагрузитьПродукцию();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Страховка: если сохранённые настройки найдены, а загрузка из них не пришла, «Продукция» перечитывается здесь.
	Если Продукция.Количество() = 0 Тогда
		ЗагрузитьПродукцию();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	// Сохранённые тумблер и состояние панели восстанавливаются после ПриСозданииНаСервере: отборы и панель - заново.
	УстановитьПараметрыСписка();
	ПрименитьСостояниеПанели(ЭтотОбъект);
	ЗагрузитьПродукцию();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Отборы панели фильтров одни для обеих закладок: список заказов получает параметры и отбор, «Продукция» перечитывается.
//
// Параметры:
//  Элемент - ПолеФормы - изменённое поле фильтра.
//
&НаКлиенте
Процедура ОтборПриИзменении(Элемент)

	ПрименитьОтборыНаСервере();
	ОбновитьТекущийЗаказ();

КонецПроцедуры

&НаКлиенте
Процедура ГруппаВерхПриСменеСтраницы(Элемент, ТекущаяСтраница)

	ОбновитьТекущийЗаказ();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаказы

&НаКлиенте
Процедура ЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	// Ключ строки списка с основной таблицей - сама ссылка (урок 2.0.15.10, forms-011).
	Если ТипЗнч(Элемент.ТекущаяСтрока) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ОткрытьДокумент(Элемент.ТекущаяСтрока);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПриАктивизацииСтроки(Элемент)

	ЗадержкаСекунд = 0.2;
	ПодключитьОбработчикОжидания("ОбновитьТекущийЗаказ", ЗадержкаСекунд, Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПродукция

&НаКлиенте
Процедура ПродукцияПриАктивизацииСтроки(Элемент)

	ЗадержкаСекунд = 0.2;
	ПодключитьОбработчикОжидания("ОбновитьТекущийЗаказ", ЗадержкаСекунд, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Не МожноМенятьЗаказы Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если Не НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	// Копия строки черновика попадает в тот же черновик новой строкой заказа; копия строки заказа в работе - в новый
	// заказ. Количество вводится заново.
	ТекущаяСтрокаПродукции = Элемент.ТекущиеДанные;
	Если Копирование И Не ТекущаяСтрокаПродукции.Редактируется Тогда
		ТекущаяСтрокаПродукции.Заказ = ПредопределенноеЗначение("Документ.ЗаказПокупателя.ПустаяСсылка");
		ТекущаяСтрокаПродукции.ЗаказПредставление = ТекстНовыйЗаказ();
	КонецЕсли;
	ТекущаяСтрокаПродукции.НомерСтроки = 0;
	ТекущаяСтрокаПродукции.Записана = Ложь;
	ТекущаяСтрокаПродукции.Редактируется = Истина;
	ТекущаяСтрокаПродукции.ЦенаИзменена = Ложь;
	ТекущаяСтрокаПродукции.Сумма = 0;
	ТекущаяСтрокаПродукции.СтатусДокумента = ТекстНеЗаписано();
	Если Копирование Тогда
		ТекущаяСтрокаПродукции.КоличествоУпаковок = 0;
		ТекущаяСтрокаПродукции.ВерсияДанных = "";
	Иначе
		ТекущаяСтрокаПродукции.ЗаказПредставление = ТекстНовыйЗаказ();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПередНачаломИзменения(Элемент, Отказ)

	ТекущаяСтрокаПродукции = Элемент.ТекущиеДанные;
	Если ТекущаяСтрокаПродукции = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не МожноМенятьЗаказы Или Не ТекущаяСтрокаПродукции.Редактируется Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСтрокаТолькоДляЧтения());
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПередУдалением(Элемент, Отказ)

	// Удаление - одним серверным вызовом по всем выделенным строкам: платформа сама удалила бы из таблицы все строки,
	// а из заказов - ни одной.
	Отказ = Истина;
	Если Не МожноМенятьЗаказы Или Элемент.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Идентификаторы = Новый Массив;
	Для Каждого Идентификатор Из Элемент.ВыделенныеСтроки Цикл
		Идентификаторы.Добавить(Идентификатор);
	КонецЦикла;
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбУдалении", ЭтотОбъект, Идентификаторы);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Удалить выделенные строки из заказов?';
		|fr = 'Supprimer les lignes sélectionnées des commandes ?';
		|en = 'Delete the selected lines from the orders?';
		|es = '¿Eliminar las líneas seleccionadas de los pedidos?'"), РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);

КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	ТекущаяСтрокаПродукции = Элемент.ТекущиеДанные;
	Если ОтменаРедактирования Или ТекущаяСтрокаПродукции = Неопределено Или Не ТекущаяСтрокаПродукции.Редактируется Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекущаяСтрокаПродукции.Клиент) Или Не ЗначениеЗаполнено(ТекущаяСтрокаПродукции.Номенклатура)
		Или ТекущаяСтрокаПродукции.КоличествоУпаковок <= 0 Тогда
		ТекущаяСтрокаПродукции.СтатусДокумента = ТекстНеЗаписано();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Строка не записана: укажите клиента, продукцию и количество.';
			|fr = 'Ligne non enregistrée : indiquez le client, le produit et la quantité.';
			|en = 'Line not saved: specify the customer, product and quantity.';
			|es = 'Línea no guardada: indique el cliente, el producto y la cantidad.'"));
		Возврат;
	КонецЕсли;
	Черновик = ЗаписатьСтрокуНаСервере(Элемент.ТекущаяСтрока);
	Если Черновик <> Неопределено Тогда
		Если ПоследниеЧерновики = Неопределено Тогда
			ПоследниеЧерновики = Новый Соответствие;
		КонецЕсли;
		ПоследниеЧерновики.Вставить(Черновик.Клиент, Черновик);
	КонецЕсли;
	ПослеЗаписиЗаказов();

КонецПроцедуры

&НаКлиенте
Процедура ПродукцияЗаказПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущаяСтрокаПродукции = Элементы.Продукция.ТекущиеДанные;
	Если ТекущаяСтрокаПродукции = Неопределено Или ТекущаяСтрокаПродукции.Записана Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекущаяСтрокаПродукции.Клиент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Сначала укажите клиента.';
			|fr = 'Indiquez d''abord le client.'; en = 'Specify the customer first.'; es = 'Indique primero el cliente.'"));
		Возврат;
	КонецЕсли;
	Список = ЧерновикиКлиента(ТекущаяСтрокаПродукции.Клиент);
	Список.Вставить(0, ПредопределенноеЗначение("Документ.ЗаказПокупателя.ПустаяСсылка"), ТекстНовыйЗаказ());
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораЧерновика", ЭтотОбъект, Элементы.Продукция.ТекущаяСтрока);
	ПоказатьВыборИзСписка(Оповещение, Список, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ПродукцияКлиентПриИзменении(Элемент)

	// Первая строка клиента создаёт черновик, следующие по умолчанию идут в черновик, куда в этом сеансе рабочего места
	// последний раз записана строка клиента. Пока записей не было - «Новый заказ»: выбор среди черновиков - кнопкой.
	ТекущаяСтрокаПродукции = Элементы.Продукция.ТекущиеДанные;
	ТекущаяСтрокаПродукции.Заказ = ПредопределенноеЗначение("Документ.ЗаказПокупателя.ПустаяСсылка");
	ТекущаяСтрокаПродукции.ЗаказПредставление = ТекстНовыйЗаказ();
	ТекущаяСтрокаПродукции.ВерсияДанных = "";
	Черновик = ЧерновикКлиентаПоУмолчанию(ТекущаяСтрокаПродукции.Клиент);
	Если Черновик <> Неопределено Тогда
		ТекущаяСтрокаПродукции.Заказ = Черновик.Заказ;
		ТекущаяСтрокаПродукции.ЗаказПредставление = Черновик.ЗаказПредставление;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПродукцияНоменклатураПриИзменении(Элемент)

	ТекущаяСтрокаПродукции = Элементы.Продукция.ТекущиеДанные;
	ТекущаяСтрокаПродукции.Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	ТекущаяСтрокаПродукции.Упаковка = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");
	ТекущаяСтрокаПродукции.ЦенаИзменена = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПродукцияЦенаПриИзменении(Элемент)

	Элементы.Продукция.ТекущиеДанные.ЦенаИзменена = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыЗаказа

&НаКлиенте
Процедура ДокументыЗаказаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Документ) Тогда
		ОткрытьДокумент(Элемент.ТекущиеДанные.Документ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СтатусВРаботу(Команда)

	ИзменитьСтатус(ДействиеВРаботу());

КонецПроцедуры

&НаКлиенте
Процедура СтатусВЧерновик(Команда)

	ИзменитьСтатус(ДействиеВЧерновик());

КонецПроцедуры

&НаКлиенте
Процедура СтатусОтменить(Команда)

	ВыбранныеЗаказы = ВыделенныеЗаказы();
	Если ВыбранныеЗаказы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбОтмене", ЭтотОбъект, ВыбранныеЗаказы);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Пометить выделенные заказы на удаление?';
		|fr = 'Marquer les commandes sélectionnées pour suppression ?';
		|en = 'Mark the selected orders for deletion?';
		|es = '¿Marcar los pedidos seleccionados para eliminar?'"), РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказПоставщику(Команда)

	СоздатьНаОсновании("Документ.ЗаказПоставщику.ФормаОбъекта");

КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступление(Команда)

	СоздатьНаОсновании("Документ.ПоступлениеТоваровУслуг.ФормаОбъекта");

КонецПроцедуры

&НаКлиенте
Процедура СоздатьПередачу(Команда)

	СоздатьНаОсновании("Документ.ПередачаВПереработку.ФормаОбъекта");

КонецПроцедуры

&НаКлиенте
Процедура СоздатьОтгрузку(Команда)

	СоздатьНаОсновании("Документ.РеализацияТоваровУслуг.ФормаОбъекта");

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПотребности(Команда)

	Если Не ЗначениеЗаполнено(ТекущийЗаказ) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстВыберитеЗаказ());
		Возврат;
	КонецЕсли;
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Отбор", Новый Структура("Заказ", ТекущийЗаказ));
	ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	ОткрытьФорму("Отчет.ПотребностиПроизводства.Форма", ПараметрыОтчета, ЭтотОбъект, ТекущийЗаказ);

КонецПроцедуры

&НаКлиенте
Процедура СвернутьПанель(Команда)

	ПанельРазвернута = Ложь;
	ПрименитьСостояниеПанели(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьПанель(Команда)

	ПанельРазвернута = Истина;
	ПрименитьСостояниеПанели(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФильтры(Команда)

	ПанельРазвернута = Истина;
	ПрименитьСостояниеПанели(ЭтотОбъект);
	Элементы.ГруппаСтраницыСведений.ТекущаяСтраница = Элементы.СтраницаФильтры;

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)

	ЗагрузитьПродукцию();
	ПослеЗаписиЗаказов();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Настройка

&НаСервере
Процедура НастроитьЭлементы()

	Элементы.ЗаказыСумма.Видимость = ПоказыватьСуммы;
	Элементы.ПродукцияЦена.Видимость = ПоказыватьСуммы;
	Элементы.ПродукцияСумма.Видимость = ПоказыватьСуммы;
	Элементы.ДокументыЗаказаСумма.Видимость = ПоказыватьСуммы;
	Элементы.ЗаказыИндикатор.Подсказка = ПроизводственныеЗаказы.ЛегендаИндикатора();
	Элементы.ПродукцияХарактеристика.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");

	Элементы.Продукция.ИзменятьСоставСтрок = МожноМенятьЗаказы;
	Элементы.ФормаСтатусВРаботу.Видимость = МожноПроводитьЗаказы;
	Элементы.ФормаСтатусВЧерновик.Видимость = МожноПроводитьЗаказы;
	Элементы.ФормаСтатусОтменить.Видимость = МожноПомечатьЗаказы;
	Элементы.ПодменюСтатус.Видимость = МожноПроводитьЗаказы Или МожноПомечатьЗаказы;
	Для Каждого Префикс Из СтрРазделить("Заказы,Продукция", ",") Цикл
		Элементы[Префикс + "СоздатьЗаказПоставщику"].Видимость = МожноЗаказПоставщику;
		Элементы[Префикс + "СоздатьПоступление"].Видимость = МожноПоступление;
		Элементы[Префикс + "СоздатьПередачу"].Видимость = МожноПередачу;
		Элементы[Префикс + "СоздатьОтгрузку"].Видимость = МожноОтгрузку;
	КонецЦикла;
	Элементы.ПродукцияИндикатор.Подсказка = Элементы.ЗаказыИндикатор.Подсказка;
	УстановитьДоступностьНаОсновании(ЭтотОбъект);

	СвязиХарактеристики = Новый Массив;
	СвязиХарактеристики.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Элементы.Продукция.ТекущиеДанные.Номенклатура"));
	Элементы.ПродукцияХарактеристика.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиХарактеристики);
	СвязиУпаковки = Новый Массив;
	СвязиУпаковки.Добавить(Новый СвязьПараметраВыбора("Номенклатура", "Элементы.Продукция.ТекущиеДанные.Номенклатура"));
	Элементы.ПродукцияУпаковка.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиУпаковки);

	// Порядок - настройкой списка, а не текстом запроса: пользовательская сортировка его не ломает.
	ЭлементПорядка = Заказы.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("Дата");
	ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	ЭлементПорядка.Использование = Истина;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	// Строки проведённых заказов - только чтение и приглушённым цветом.
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Продукция.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Продукция.Редактируется");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.Цвет_ПоясняющийТекст);

	// У записанной строки клиент и заказ не меняются: перенос строки между заказами - в форме заказа.
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродукцияКлиент.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродукцияЗаказПредставление.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Продукция.Записана");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

КонецПроцедуры

// Возвращаемое значение:
//  Булево - у пользователя есть сохранённые данные формы: после создания платформа вызовет
//           ПриЗагрузкеДанныхИзНастроекНаСервере.
//
&НаСервере
Функция ЕстьСохраненныеНастройки()

	КлючОбъекта = ИмяФормы + "/ТекущиеДанные";
	Возврат ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта) <> Неопределено;

КонецФункции

// Параметры и отбор списка заказов по панели фильтров: вид операции, клиент, продукция в составе заказа.
&НаСервере
Процедура УстановитьПараметрыСписка()

	Заказы.Параметры.УстановитьЗначениеПараметра("ВсеЗаказы", РежимОчереди = 1);
	Заказы.Параметры.УстановитьЗначениеПараметра("ЛюбаяПродукция", Не ЗначениеЗаполнено(ОтборПродукция));
	Заказы.Параметры.УстановитьЗначениеПараметра("Продукция", ОтборПродукция);
	ОтборКонтрагента = Неопределено;
	Для Каждого ЭлементОтбора Из Заказы.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент") Тогда
			ОтборКонтрагента = ЭлементОтбора;
		КонецЕсли;
	КонецЦикла;
	Если ОтборКонтрагента = Неопределено Тогда
		ОтборКонтрагента = Заказы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборКонтрагента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
		ОтборКонтрагента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	ОтборКонтрагента.ПравоеЗначение = ОтборКлиент;
	ОтборКонтрагента.Использование = ЗначениеЗаполнено(ОтборКлиент);

КонецПроцедуры

&НаСервере
Процедура ПрименитьОтборыНаСервере()

	УстановитьПараметрыСписка();
	ЗагрузитьПродукцию();

КонецПроцедуры

// Отборы панели для строк «Продукции».
//
// Возвращаемое значение:
//  Структура - см. Обработки.АРМПроизводство.НовыеОтборы.
//
&НаСервере
Функция ОтборыПанели()

	Отборы = Обработки.АРМПроизводство.НовыеОтборы();
	Отборы.ВсеЗаказы = РежимОчереди = 1;
	Отборы.Клиент = ОтборКлиент;
	Отборы.Продукция = ОтборПродукция;
	Возврат Отборы;

КонецФункции

// Свёрнутая панель - столбик значков, развёрнутая - страница фильтров с кнопкой свернуть внизу, как в списках документов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - рабочее место.
//
&НаКлиентеНаСервереБезКонтекста
Процедура ПрименитьСостояниеПанели(Форма)

	ЭлементыФормы = Форма.Элементы;
	ЭлементыФормы.ГруппаПанельЗначки.Видимость = Не Форма.ПанельРазвернута;
	ЭлементыФормы.ГруппаСтраницыСведений.Видимость = Форма.ПанельРазвернута;
	ЭлементыФормы.ГруппаПодвалПанели.Видимость = Форма.ПанельРазвернута;

КонецПроцедуры

// Кнопки ввода на основании видны над таблицей, когда выделен заказ на производство в работе.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - рабочее место.
//
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьНаОсновании(Форма)

	ЭлементыФормы = Форма.Элементы;
	ЭлементыФормы.ГруппаДействияЗаказы.Видимость = Форма.МожноНаОсновании;
	ЭлементыФормы.ГруппаДействияПродукция.Видимость = Форма.МожноНаОсновании;

КонецПроцедуры

#КонецОбласти

#Область Продукция

&НаСервере
Процедура ЗагрузитьПродукцию()

	Результат = Обработки.АРМПроизводство.СтрокиПродукции(ОтборыПанели());
	// Незаписанные строки не теряются при перечитывании: они возвращаются в начало таблицы.
	Незаписанные = Продукция.Выгрузить(Новый Структура("Записана", Ложь));
	Продукция.Загрузить(Результат.Строки);
	Для Индекс = 1 По Незаписанные.Количество() Цикл
		ЗаполнитьЗначенияСвойств(Продукция.Вставить(0), Незаписанные[Незаписанные.Количество() - Индекс]);
	КонецЦикла;
	Если Результат.Обрезано Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Показаны строки последних 300 заказов.';
			|fr = 'Les lignes des 300 dernières commandes sont affichées.';
			|en = 'Lines of the last 300 orders are shown.';
			|es = 'Se muestran las líneas de los últimos 300 pedidos.'"));
	КонецЕсли;

КонецПроцедуры

// Записывает строку «Продукции» и заменяет строки её заказа в таблице.
//
// Параметры:
//  Идентификатор - Число - идентификатор строки таблицы «Продукция».
//
// Возвращаемое значение:
//  Структура, Неопределено - Клиент, Заказ, ЗаказПредставление записанного черновика; отказ - Неопределено.
//
&НаСервере
Функция ЗаписатьСтрокуНаСервере(Знач Идентификатор)

	СтрокаТаблицы = Продукция.НайтиПоИдентификатору(Идентификатор);
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ДанныеСтроки = Обработки.АРМПроизводство.НовыеДанныеСтроки();
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаТаблицы);
	Результат = Обработки.АРМПроизводство.ЗаписатьСтрокуПродукции(ДанныеСтроки);
	Если Не ПустаяСтрока(Результат.Текст) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.Текст);
	КонецЕсли;
	Если Результат.Перечитать Тогда
		ЗагрузитьПродукцию();
		Возврат Неопределено;
	КонецЕсли;
	Если Не Результат.Успех Тогда
		СтрокаТаблицы.СтатусДокумента = ТекстНеЗаписано();
		Возврат Неопределено;
	КонецЕсли;
	Позиция = ЗаменитьСтрокиЗаказа(Результат, Продукция.Индекс(СтрокаТаблицы), СтрокаТаблицы);
	Если Позиция = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Записанная = Продукция[Позиция];
	Элементы.Продукция.ТекущаяСтрока = Записанная.ПолучитьИдентификатор();
	Возврат Новый Структура("Клиент, Заказ, ЗаказПредставление", ДанныеСтроки.Клиент, Записанная.Заказ,
		Записанная.ЗаказПредставление);

КонецФункции

&НаСервере
Процедура УдалитьСтрокиНаСервере(Знач Идентификаторы)

	СтрокиДанных = ДанныеУдаляемыхСтрок(Идентификаторы);
	Если СтрокиДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Перечитать = Ложь;
	Для Каждого Результат Из Обработки.АРМПроизводство.УдалитьСтрокиПродукции(СтрокиДанных) Цикл
		Если Не ПустаяСтрока(Результат.Текст) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.Текст);
		КонецЕсли;
		Перечитать = Перечитать Или Результат.Перечитать;
		Если Результат.ЗаказПомечен Тогда
			УдалитьСтрокиТаблицыЗаказа(Результат.Заказ);
		ИначеЕсли Результат.Успех Тогда
			ЗаменитьСтрокиЗаказа(Результат, Неопределено, Неопределено);
		Иначе
			Перечитать = Истина;
		КонецЕсли;
	КонецЦикла;
	Если Перечитать Тогда
		ЗагрузитьПродукцию();
	КонецЕсли;

КонецПроцедуры

// Незаписанные строки удаляются из таблицы сразу, строки заказов в работе остаются с сообщением.
//
// Параметры:
//  Идентификаторы - Массив из Число - идентификаторы выделенных строк «Продукции».
//
// Возвращаемое значение:
//  Массив из Структура - данные записанных строк черновиков, см. Обработки.АРМПроизводство.НовыеДанныеСтроки.
//
&НаСервере
Функция ДанныеУдаляемыхСтрок(Идентификаторы)

	СтрокиДанных = Новый Массив;
	Для Каждого Идентификатор Из Идентификаторы Цикл
		СтрокаТаблицы = Продукция.НайтиПоИдентификатору(Идентификатор);
		Если СтрокаТаблицы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если Не СтрокаТаблицы.Записана Тогда
			Продукция.Удалить(СтрокаТаблицы);
		ИначеЕсли СтрокаТаблицы.Редактируется Тогда
			ДанныеСтроки = Обработки.АРМПроизводство.НовыеДанныеСтроки();
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаТаблицы);
			СтрокиДанных.Добавить(ДанныеСтроки);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСтрокаТолькоДляЧтения());
		КонецЕсли;
	КонецЦикла;
	Возврат СтрокиДанных;

КонецФункции

// Заменяет строки заказа в таблице строками из результата записи: номера строк после записи и удаления сдвигаются.
//
// Параметры:
//  Результат         - Структура - см. Обработки.АРМПроизводство.ЗаписатьСтрокуПродукции.
//  ИндексПравленой   - Число, Неопределено - индекс строки, которую правили: новая строка ещё не принадлежит заказу.
//  ПравленаяСтрока   - ДанныеФормыЭлементКоллекции, Неопределено - строка, которую правили.
//
// Возвращаемое значение:
//  Число, Неопределено - индекс записанной строки в таблице.
//
&НаСервере
Функция ЗаменитьСтрокиЗаказа(Результат, ИндексПравленой, ПравленаяСтрока)

	Позиция = ИндексПравленой;
	Всего = Продукция.Количество();
	Для Индекс = 1 По Всего Цикл
		ИндексСтроки = Всего - Индекс;
		СтрокаТаблицы = Продукция[ИндексСтроки];
		Если СтрокаТаблицы = ПравленаяСтрока Или СтрокаТаблицы.Записана И СтрокаТаблицы.Заказ = Результат.Заказ Тогда
			Позиция = ИндексСтроки;
			Продукция.Удалить(ИндексСтроки);
		КонецЕсли;
	КонецЦикла;
	Если Позиция = Неопределено Тогда
		Позиция = 0;
	КонецЕсли;
	ИндексЗаписанной = Неопределено;
	Для Каждого ДанныеСтроки Из Результат.СтрокиЗаказа Цикл
		// Отбор панели по продукции действует и после записи: строки другой продукции заказа не вставляются.
		ВнеОтбора = ЗначениеЗаполнено(ОтборПродукция) И ДанныеСтроки.Номенклатура <> ОтборПродукция;
		Если ВнеОтбора И ДанныеСтроки.НомерСтроки <> Результат.НомерСтроки Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Продукция.Вставить(Позиция);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСтроки);
		Если ДанныеСтроки.НомерСтроки = Результат.НомерСтроки Тогда
			ИндексЗаписанной = Позиция;
		КонецЕсли;
		Позиция = Позиция + 1;
	КонецЦикла;
	Возврат ИндексЗаписанной;

КонецФункции

&НаСервере
Процедура УдалитьСтрокиТаблицыЗаказа(Заказ)

	Для Каждого СтрокаТаблицы Из Продукция.НайтиСтроки(Новый Структура("Заказ, Записана", Заказ, Истина)) Цикл
		Продукция.Удалить(СтрокаТаблицы);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбУдалении(Ответ, Идентификаторы) Экспорт

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	УдалитьСтрокиНаСервере(Идентификаторы);
	ПослеЗаписиЗаказов();

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЧерновика(ВыбранныйЭлемент, Идентификатор) Экспорт

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрокаТаблицы = Продукция.НайтиПоИдентификатору(Идентификатор);
	Если СтрокаТаблицы = Неопределено Или СтрокаТаблицы.Записана Тогда
		Возврат;
	КонецЕсли;
	СтрокаТаблицы.Заказ = ВыбранныйЭлемент.Значение;
	СтрокаТаблицы.ЗаказПредставление = ВыбранныйЭлемент.Представление;
	// Новая строка в выбранный черновик: версия не нужна, сервер проверит заказ после блокировки.
	СтрокаТаблицы.ВерсияДанных = "";

КонецПроцедуры

// Черновик для новой строки клиента: куда в этом сеансе последний раз записана его строка, иначе самый свежий черновик
// клиента среди строк таблицы. Черновик из памяти берётся, только пока его строки в таблице ещё редактируются: заказ,
// переведённый в работу или помеченный, по умолчанию не подставляется.
//
// Параметры:
//  Клиент - СправочникСсылка.Контрагенты - клиент строки.
//
// Возвращаемое значение:
//  Структура, Неопределено - Заказ, ЗаказПредставление; черновика нет - Неопределено.
//
&НаКлиенте
Функция ЧерновикКлиентаПоУмолчанию(Клиент)

	ИзСеанса = Неопределено;
	Если ПоследниеЧерновики <> Неопределено Тогда
		ИзСеанса = ПоследниеЧерновики.Получить(Клиент);
	КонецЕсли;
	СвежийВТаблице = Неопределено;
	Для Каждого СтрокаТаблицы Из Продукция Цикл
		Если Не СтрокаТаблицы.Записана Или Не СтрокаТаблицы.Редактируется Или СтрокаТаблицы.Клиент <> Клиент Тогда
			Продолжить;
		КонецЕсли;
		Если ИзСеанса <> Неопределено И СтрокаТаблицы.Заказ = ИзСеанса.Заказ Тогда
			Возврат Новый Структура("Заказ, ЗаказПредставление", СтрокаТаблицы.Заказ, СтрокаТаблицы.ЗаказПредставление);
		КонецЕсли;
		Если СвежийВТаблице = Неопределено Тогда
			СвежийВТаблице = Новый Структура("Заказ, ЗаказПредставление", СтрокаТаблицы.Заказ, СтрокаТаблицы.ЗаказПредставление);
		КонецЕсли;
	КонецЦикла;
	Возврат СвежийВТаблице;

КонецФункции

&НаСервереБезКонтекста
Функция ЧерновикиКлиента(Знач Клиент)

	Возврат Обработки.АРМПроизводство.ЧерновикиКлиента(Клиент);

КонецФункции

#КонецОбласти

#Область Статус

&НаКлиенте
Процедура ИзменитьСтатус(Действие)

	ВыбранныеЗаказы = ВыделенныеЗаказы();
	Если ВыбранныеЗаказы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ИзменитьСтатусНаСервере(ВыбранныеЗаказы, Действие);
	ПослеЗаписиЗаказов();

КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОтмене(Ответ, ВыбранныеЗаказы) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ИзменитьСтатусНаСервере(ВыбранныеЗаказы, ДействиеОтменить());
		ПослеЗаписиЗаказов();
	КонецЕсли;

КонецПроцедуры

// Заказы выделенных строк активной верхней закладки: у списка заказов ключ строки - ссылка, у «Продукции» - заказы
// записанных строк без повторов.
//
// Возвращаемое значение:
//  Массив из ДокументСсылка.ЗаказПокупателя - выделенные заказы.
//
&НаКлиенте
Функция ВыделенныеЗаказы()

	Результат = Новый Массив;
	Если Элементы.ГруппаВерх.ТекущаяСтраница = Элементы.СтраницаЗаказы Тогда
		Для Каждого КлючСтроки Из Элементы.Заказы.ВыделенныеСтроки Цикл
			Если ТипЗнч(КлючСтроки) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				Результат.Добавить(КлючСтроки);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого Идентификатор Из Элементы.Продукция.ВыделенныеСтроки Цикл
			СтрокаТаблицы = Продукция.НайтиПоИдентификатору(Идентификатор);
			Если СтрокаТаблицы <> Неопределено И СтрокаТаблицы.Записана И Результат.Найти(СтрокаТаблицы.Заказ) = Неопределено Тогда
				Результат.Добавить(СтрокаТаблицы.Заказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Результат.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстВыберитеЗаказ());
	КонецЕсли;
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ИзменитьСтатусНаСервере(Знач ВыбранныеЗаказы, Знач Действие)

	Для Каждого Итог Из Обработки.АРМПроизводство.ИзменитьСтатусЗаказов(ВыбранныеЗаказы, Действие) Цикл
		Если Не ПустаяСтрока(Итог.Текст) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("%1: %2", Итог.Заказ, Итог.Текст));
		КонецЕсли;
	КонецЦикла;
	ЗагрузитьПродукцию();

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДействиеВРаботу()
	Возврат "ВРаботу";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДействиеВЧерновик()
	Возврат "ВЧерновик";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДействиеОтменить()
	Возврат "Отменить";
КонецФункции

#КонецОбласти

#Область ТекущийЗаказ

&НаКлиенте
Процедура ОбновитьТекущийЗаказ()

	Заказ = ПредопределенноеЗначение("Документ.ЗаказПокупателя.ПустаяСсылка");
	Если Элементы.ГруппаВерх.ТекущаяСтраница = Элементы.СтраницаЗаказы Тогда
		Если ТипЗнч(Элементы.Заказы.ТекущаяСтрока) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Заказ = Элементы.Заказы.ТекущаяСтрока;
		КонецЕсли;
	ИначеЕсли Элементы.Продукция.ТекущиеДанные <> Неопределено Тогда
		Заказ = Элементы.Продукция.ТекущиеДанные.Заказ;
	Иначе
		// Нет текущей строки продукции: нижние закладки пустые.
		Заказ = ПредопределенноеЗначение("Документ.ЗаказПокупателя.ПустаяСсылка");
	КонецЕсли;
	ОбновитьТекущийЗаказНаСервере(Заказ);

КонецПроцедуры

&НаСервере
Процедура ОбновитьТекущийЗаказНаСервере(Знач Заказ)

	ТекущийЗаказ = Заказ;
	Данные = Обработки.АРМПроизводство.ДанныеТекущегоЗаказа(Заказ);
	Материалы.Загрузить(Данные.Материалы);
	ДокументыЗаказа.Загрузить(Данные.Документы);
	МожноНаОсновании = Данные.МожноНаОсновании;
	УстановитьДоступностьНаОсновании(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиЗаказов()

	Элементы.Заказы.Обновить();
	ОбновитьТекущийЗаказ();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОсновании(ИмяФормы)

	Если Не МожноНаОсновании Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документы вводятся только по заказу на производство в работе.';
			|fr = 'Les documents se saisissent uniquement pour une commande en production lancée.';
			|en = 'Documents are entered only for a production order in progress.';
			|es = 'Los documentos se introducen solo para un pedido para producción en marcha.'"));
		Возврат;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияДокумента", ЭтотОбъект);
	ОткрытьФорму(ИмяФормы, Новый Структура("Основание", ТекущийЗаказ), ЭтотОбъект, , , , Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Ссылка)

	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияДокумента", ЭтотОбъект);
	ОткрытьФорму(ИмяФормыОбъекта(Ссылка), Новый Структура("Ключ", Ссылка), ЭтотОбъект, , , , Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДокумента(Результат, ДопПараметры) Экспорт

	ЗагрузитьПродукцию();
	ПослеЗаписиЗаказов();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяФормыОбъекта(Знач Ссылка)

	Возврат Ссылка.Метаданные().ПолноеИмя() + ".ФормаОбъекта";

КонецФункции

#КонецОбласти

#Область Тексты

&НаКлиентеНаСервереБезКонтекста
Функция ТекстНовыйЗаказ()

	Возврат НСтр("ru = 'Новый заказ'; fr = 'Nouvelle commande'; en = 'New order'; es = 'Pedido nuevo'");

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстНеЗаписано()

	Возврат НСтр("ru = 'Не записано'; fr = 'Non enregistré'; en = 'Not saved'; es = 'No guardado'");

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстСтрокаТолькоДляЧтения()

	Возврат НСтр("ru = 'Заказ в работе: строки меняются после возврата в черновик кнопкой «Статус» или в форме заказа.';
		|fr = 'La commande est lancée : modifiez les lignes après retour en brouillon (bouton « Statut ») ou dans la commande.';
		|en = 'The order is in progress: change lines after returning it to draft (Status button) or in the order form.';
		|es = 'El pedido está en marcha: cambie las líneas tras devolverlo a borrador (botón Estado) o en el pedido.'");

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстВыберитеЗаказ()

	Возврат НСтр("ru = 'Выберите заказ.'; fr = 'Sélectionnez une commande.'; en = 'Select an order.'; es = 'Seleccione un pedido.'");

КонецФункции

#КонецОбласти

#КонецОбласти
